<a href="https://colab.research.google.com/github/rebeccalizaverghese/BA-with-SQL/blob/main/Introduction_to_SQLite_with_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import sqlite3

In [8]:
x = sqlite3.connect('NeDB 1.db')

In [9]:
Y = x.cursor()

In [10]:
Y.execute('''CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')

In [11]:
Y.execute("INSERT INTO Employee VALUES ('2020-01-01','John','Adam',32),('2020-01-01','Mike','Joseph',30),('2020-01-01','Ann','Maria',32);")

In [12]:
x.commit()

In [13]:
Y.close()

In [14]:
import sqlite3

In [16]:
conn = sqlite3.connect('Newdb3.db')

In [17]:
cursor = conn.cursor()

In [23]:
import sqlite3
 
conn = sqlite3.connect('NewDB4.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)

students = [('John', '8', 'A'),
   ('Adam', '8', 'B'),
   ('Ann', '10', 'A'),
]

cursor.executemany('INSERT INTO STUDENT VALUES (?,?,?)', students)

print("Data Inserted in the table: ")
data=cursor.execute('''SELECT * FROM STUDENT''')
for row in data:
	print(row)


conn.commit()

conn.close()

Data Inserted in the table:
('John', '8', 'A')
('Adam', '8', 'B')
('Ann', '10', 'A')

In [24]:
import sqlite3
 
conn = sqlite3.connect('NewDB001.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


print("Data Inserted in the table: ")
data=cursor.execute('''SELECT * FROM STUDENT''')
for row in data:
	print(row)


conn.commit()

conn.close()

Data Inserted in the table:
('John', '8', 'A')
('Adam', '8', 'B')
('Ann', '10', 'A')

In [26]:
import sqlite3
 
conn = sqlite3.connect('NewDB.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT WHERE CLASS = '10'")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('Ann', '10', 'A')]

In [34]:
import sqlite3
conn = sqlite3.connect('NewDB10.db')
cursor = conn.cursor()
table ="""CREATE TABLE CLASS(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)
cursor.execute('''INSERT INTO CLASS VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO CLASS VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO CLASS VALUES ('Ann', '10', 'A')''')
cursor.execute("SELECT * FROM CLASS WHERE NAME Like'A%'")

print(cursor.fetchall())
conn.commit()
conn.close()

[('Adam', '8', 'B'), ('Ann', '10', 'A')]

In [31]:
import sqlite3
conn = sqlite3.connect('Newdb12.db')
cursor = conn.cursor()
table ="""CREATE TABLE STUDENT (NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)
cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')
cursor.execute("SELECT * FROM STUDENT ORDER BY NAME DESC")
print(cursor.fetchall())
conn.commit()
conn.close()

[('John', '8', 'A'), ('Ann', '10', 'A'), ('Adam', '8', 'B')]

In [33]:
import sqlite3
conn = sqlite3.connect('Newdb13.db')
cursor = conn.cursor()
table ="""CREATE TABLE STUDENT (NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)
cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')
cursor.execute("SELECT NAME, CLASS FROM STUDENT ORDER BY NAME DESC")
print(cursor.fetchall())
conn.commit()
conn.close()

[('John', '8'), ('Ann', '10'), ('Adam', '8')]